therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G310X.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>CANFD0</name>
            <groupName>CANFD</groupName>
            <version>1.0</version>
            <description>PERIPHERALREGION</description>
            <baseAddress>0x40508000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x8000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CANFD0_PWREN</name>
                    <description>Power enable</description>
                    <addressOffset>0x6800</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ENABLE</name>
                            <description>Enable the power</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable Power</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable Power</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>CANFD0_RSTCTL</name>
                    <description>Reset Control</description>
                    <addressOffset>0x6804</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RESETSTKYCLR</name>
                            <description>Clear the RESETSTKY bit in the STAT register</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NOP</name>
                                        <description>Writing 0 has no effect</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLR</name>
                                        <description>Clear reset sticky bit</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RESETASSERT</name>
                            <description>Assert reset to the peripheral</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NOP</name>
                                        <description>Writing 0 has no effect</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ASSERT</name>
                                        <description>Assert reset</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>CANFD0_STAT</name>
                    <description>Status Register</description>
                    <addressOffset>0x6814</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>RESETSTKY</name>
                            <description>This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NORES</name>
                                        <description>The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RESET</name>
                                        <description>The peripheral was reset since the last bit clear</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>252</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>CANFD0_MCAN[%s]</name>
                    <description></description>
                    <addressOffset>0x7000</addressOffset>
                    <register>
                        <name>CANFD0_MCAN_CREL</name>
                        <description>MCAN Core Release Register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x32380608</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>DAY</name>
                                <description>Time Stamp Day. Two digits, BCD-coded.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>MON</name>
                                <description>Time Stamp Month. Two digits, BCD-coded.</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>YEAR</name>
                                <description>Time Stamp Year. One digit, BCD-coded.</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>SUBSTEP</name>
                                <description>Sub-Step of Core Release. One digit, BCD-coded.</description>
                                <bitOffset>0x14</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>STEP</name>
                                <description>Step of Core Release. One digit, BCD-coded.</description>
                                <bitOffset>0x18</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>REL</name>
                                <description>Core Release. One digit, BCD-coded.</description>
                                <bitOffset>0x1C</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-only</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_ENDN</name>
                        <description>MCAN Endian Register</description>
                        <addressOffset>0x4</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x87654321</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_DBTP</name>
                        <description>MCAN Data Bit Timing and Prescaler Register</description>
                        <addressOffset>0xC</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000a33</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>DSJW</name>
                                <description>Data Resynchronization Jump Width. Valid values are 0 to 15. The actual interpretation by the hardware of this value is such that one more than the value programmed here is used.
 
