therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G310X.svd
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1D</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_HPMS</name>
                        <description>MCAN High Priority Message Status</description>
                        <addressOffset>0x94</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>BIDX</name>
                                <description>Buffer Index. Index of Rx FIFO element to which the message was stored. Only valid when MSI(1) = '1'.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x6</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>MSI</name>
                                <description>Message Storage Indicator
  00  No FIFO selected
  01  FIFO message lost
  10  Message stored in FIFO 0
  11  Message stored in FIFO 1</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>FIDX</name>
                                <description>Filter Index. Index of matching filter element. Range is 0 to SIDFC.LSS - 1 resp. XIDFC.LSE - 1.</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x7</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>FLST</name>
                                <description>Filter List. Indicates the filter list of the matching filter element.
  0  Standard Filter List
  1  Extended Filter List</description>
                                <bitOffset>0xF</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_NDAT1</name>
                        <description>MCAN New Data 1</description>
                        <addressOffset>0x98</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ND0</name>
                                <description>New Data RX Buffer 0
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND1</name>
                                <description>New Data RX Buffer 1
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND2</name>
                                <description>New Data RX Buffer 2
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND3</name>
                                <description>New Data RX Buffer 3
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND4</name>
                                <description>New Data RX Buffer 4
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND5</name>
                                <description>New Data RX Buffer 5
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND6</name>
                                <description>New Data RX Buffer 6
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND7</name>
                                <description>New Data RX Buffer 7
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND8</name>
                                <description>New Data RX Buffer 8
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND9</name>
                                <description>New Data RX Buffer 9
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x9</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND10</name>
                                <description>New Data RX Buffer 10
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0xA</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND11</name>
                                <description>New Data RX Buffer 11
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0xB</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND12</name>
                                <description>New Data RX Buffer 12
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0xC</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND13</name>
                                <description>New Data RX Buffer 13
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0xD</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND14</name>
                                <description>New Data RX Buffer 14
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0xE</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND15</name>
                                <description>New Data RX Buffer 15
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0xF</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND16</name>
                                <description>New Data RX Buffer 16
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND17</name>
                                <description>New Data RX Buffer 17
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x11</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND18</name>
                                <description>New Data RX Buffer 18
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x12</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND19</name>
                                <description>New Data RX Buffer 19
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x13</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND20</name>
                                <description>New Data RX Buffer 20
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x14</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND21</name>
                                <description>New Data RX Buffer 21
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x15</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND22</name>
                                <description>New Data RX Buffer 22
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x16</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND23</name>
                                <description>New Data RX Buffer 23
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x17</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND24</name>
                                <description>New Data RX Buffer 24
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x18</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND25</name>
                                <description>New Data RX Buffer 25
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x19</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND26</name>
                                <description>New Data RX Buffer 26
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x1A</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND27</name>
                                <description>New Data RX Buffer 27
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x1B</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND28</name>
                                <description>New Data RX Buffer 28
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x1C</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND29</name>
                                <description>New Data RX Buffer 29
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x1D</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND30</name>
                                <description>New Data RX Buffer 30
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x1E</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND31</name>
                                <description>New Data RX Buffer 31
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x1F</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
