therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G310X.svd
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x7</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>F1WM</name>
                                <description>Rx FIFO 1 Watermark
  0      Watermark interrupt disabled
  1-64  Level for Rx FIFO 1 watermark interrupt (IR.RF1W)
  &gt;64   Watermark interrupt disabled
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x18</bitOffset>
                                <bitWidth>0x7</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>F1OM</name>
                                <description>FIFO 1 Operation Mode. FIFO 1 can be operated in blocking or in overwrite mode.
  0  FIFO 1 blocking mode
  1  FIFO 1 overwrite mode
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x1F</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_RXF1S</name>
                        <description>MCAN Rx FIFO 1 Status</description>
                        <addressOffset>0xB4</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>F1FL</name>
                                <description>Rx FIFO 1 Fill Level. Number of elements stored in Rx FIFO 1, range 0 to 64.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x7</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>F1GI</name>
                                <description>Rx FIFO 1 Get Index. Rx FIFO 1 read index pointer, range 0 to 63.</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x6</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>F1PI</name>
                                <description>Rx FIFO 1 Put Index. Rx FIFO 1 write index pointer, range 0 to 63.</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x6</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>F1F</name>
                                <description>Rx FIFO 1 Full
  0  Rx FIFO 1 not full
  1  Rx FIFO 1 full</description>
                                <bitOffset>0x18</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>RF1L</name>
                                <description>Rx FIFO 1 Message Lost. This bit is a copy of interrupt flag IR.RF1L. When IR.RF1L is reset, this bit is also reset.
  0  No Rx FIFO 1 message lost
  1  Rx FIFO 1 message lost, also set after write attempt to Rx FIFO 1 of size zero
 
Note: Overwriting the oldest message when RXF1C.F1OM = '1' will not set this flag.</description>
                                <bitOffset>0x19</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>DMS</name>
                                <description>Debug Message Status
  00  Idle state, wait for reception of debug messages
  01  Debug message A received
  10  Debug messages A, B received
  11  Debug messages A, B, C received</description>
                                <bitOffset>0x1E</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-only</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_RXF1A</name>
                        <description>MCAN Rx FIFO 1 Acknowledge</description>
                        <addressOffset>0xB8</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>F1AI</name>
                                <description>Rx FIFO 1 Acknowledge Index. After the Host has read a message or a sequence of messages from Rx FIFO 1 it has to write the buffer index of the last element read from Rx FIFO 1 to F1AI. This will set the Rx FIFO 1 Get Index RXF1S.F1GI to F1AI + 1 and update the FIFO 1 Fill Level RXF1S.F1FL.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x6</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_RXESC</name>
                        <description>MCAN Rx Buffer / FIFO Element Size Configuration</description>
                        <addressOffset>0xBC</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>F0DS</name>
                                <description>Rx FIFO 0 Data Field Size
  000  8 byte data field
  001  12 byte data field
  010  16 byte data field
  011  20 byte data field
  100  24 byte data field
  101  32 byte data field
  110  48 byte data field
  111  64 byte data field
 
Note: In case the data field size of an accepted CAN frame exceeds the data field size configured for the matching Rx Buffer or Rx FIFO, only the number of bytes as configured by RXESC are stored to the Rx Buffer resp. Rx FIFO element. The rest of the frame's data field is ignored.
 
