therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G310X.svd
Note: In case of mixed configurations where dedicated Tx Buffers are combined with a Tx FIFO or a Tx Queue, the Put and Get Indices indicate the number of the Tx Buffer starting with the first dedicated Tx Buffers. Example: For a configuration of 12 dedicated Tx Buffers and a Tx FIFO of 20 Buffers a Put Index of 15 points to the fourth buffer of the Tx FIFO.</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x5</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TFQP</name>
                                <description>Tx FIFO/Queue Put Index. Tx FIFO/Queue write index pointer, range 0 to 31.
 
Note: In case of mixed configurations where dedicated Tx Buffers are combined with a Tx FIFO or a Tx Queue, the Put and Get Indices indicate the number of the Tx Buffer starting with the first dedicated Tx Buffers. Example: For a configuration of 12 dedicated Tx Buffers and a Tx FIFO of 20 Buffers a Put Index of 15 points to the fourth buffer of the Tx FIFO.</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x5</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TFQF</name>
                                <description>Tx FIFO/Queue Full
  0  Tx FIFO/Queue not full
  1  Tx FIFO/Queue full</description>
                                <bitOffset>0x15</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_TXESC</name>
                        <description>MCAN Tx Buffer Element Size Configuration</description>
                        <addressOffset>0xC8</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>TBDS</name>
                                <description>Tx Buffer Data Field Size
  000  8 byte data field
  001  12 byte data field
  010  16 byte data field
  011  20 byte data field
  100  24 byte data field
  101  32 byte data field
  110  48 byte data field
  111  64 byte data field
 
Note: In case the data length code DLC of a Tx Buffer element is configured to a value higher than the Tx Buffer data field size TXESC.TBDS, the bytes not defined by the Tx Buffer are transmitted as &amp;quot;0xCC&amp;quot; (padding bytes).
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_TXBRP</name>
                        <description>MCAN Tx Buffer Request Pending</description>
                        <addressOffset>0xCC</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>TRP0</name>
                                <description>Transmission Request Pending 0.
 
Each Tx Buffer has its own Transmission Request Pending bit. The bits are set via register TXBAR. The bits are reset after a requested transmission has completed or has been cancelled via register TXBCR.
 
TXBRP bits are set only for those Tx Buffers configured via TXBC. After a TXBRP bit has been set, a Tx scan is started to check for the pending Tx request with the highest priority (Tx Buffer with lowest Message ID).
 
A cancellation request resets the corresponding transmission request pending bit of register TXBRP. In case a transmission has already been started when a cancellation is requested, this is done at the end of the transmission, regardless whether the transmission was successful or not. The cancellation request bits are reset directly after the corresponding TXBRP bit has been reset.
 
After a cancellation has been requested, a finished cancellation is signalled via TXBCF
- after successful transmission together with the corresponding TXBTO bit
- when the transmission has not yet been started at the point of cancellation
- when the transmission has been aborted due to lost arbitration
- when an error occurred during frame transmission
 
In DAR mode all transmissions are automatically cancelled if they are not successful. The corresponding TXBCF bit is set for all unsuccessful transmissions.
  0  No transmission request pending
  1  Transmission request pending
 
Note: TXBRP bits which are set while a Tx scan is in progress are not considered during this particular Tx scan. In case a cancellation is requested for such a Tx Buffer, this Add Request is cancelled immediately, the corresponding TXBRP bit is reset.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP1</name>
                                <description>Transmission Request Pending 1. See description for bit 0.</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP2</name>
                                <description>Transmission Request Pending 2. See description for bit 0.</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP3</name>
                                <description>Transmission Request Pending 3. See description for bit 0.</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP4</name>
                                <description>Transmission Request Pending 4. See description for bit 0.</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP5</name>
                                <description>Transmission Request Pending 5. See description for bit 0.</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP6</name>
                                <description>Transmission Request Pending 6. See description for bit 0.</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP7</name>
                                <description>Transmission Request Pending 7. See description for bit 0.</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP8</name>
                                <description>Transmission Request Pending 8. See description for bit 0.</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP9</name>
                                <description>Transmission Request Pending 9. See description for bit 0.</description>
                                <bitOffset>0x9</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP10</name>
                                <description>Transmission Request Pending 10. See description for bit 0.</description>
                                <bitOffset>0xA</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP11</name>
                                <description>Transmission Request Pending 11. See description for bit 0.</description>
                                <bitOffset>0xB</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP12</name>
                                <description>Transmission Request Pending 12. See description for bit 0.</description>
                                <bitOffset>0xC</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP13</name>
                                <description>Transmission Request Pending 13. See description for bit 0.</description>
                                <bitOffset>0xD</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP14</name>
                                <description>Transmission Request Pending 14. See description for bit 0.</description>
                                <bitOffset>0xE</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP15</name>
                                <description>Transmission Request Pending 15. See description for bit 0.</description>
                                <bitOffset>0xF</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP16</name>
                                <description>Transmission Request Pending 16. See description for bit 0.</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP17</name>
                                <description>Transmission Request Pending 17. See description for bit 0.</description>
                                <bitOffset>0x11</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP18</name>
                                <description>Transmission Request Pending 18. See description for bit 0.</description>
                                <bitOffset>0x12</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP19</name>
                                <description>Transmission Request Pending 19. See description for bit 0.</description>
                                <bitOffset>0x13</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP20</name>
                                <description>Transmission Request Pending 20. See description for bit 0.</description>
                                <bitOffset>0x14</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP21</name>
                                <description>Transmission Request Pending 21. See description for bit 0.</description>
                                <bitOffset>0x15</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP22</name>
                                <description>Transmission Request Pending 22. See description for bit 0.</description>
                                <bitOffset>0x16</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP23</name>
                                <description>Transmission Request Pending 23. See description for bit 0.</description>
                                <bitOffset>0x17</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP24</name>
                                <description>Transmission Request Pending 24. See description for bit 0.</description>
                                <bitOffset>0x18</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP25</name>
                                <description>Transmission Request Pending 25. See description for bit 0.</description>
                                <bitOffset>0x19</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP26</name>
                                <description>Transmission Request Pending 26. See description for bit 0.</description>
                                <bitOffset>0x1A</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP27</name>
                                <description>Transmission Request Pending 27. See description for bit 0.</description>
                                <bitOffset>0x1B</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP28</name>
                                <description>Transmission Request Pending 28. See description for bit 0.</description>
                                <bitOffset>0x1C</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP29</name>
                                <description>Transmission Request Pending 29. See description for bit 0.</description>
                                <bitOffset>0x1D</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP30</name>
                                <description>Transmission Request Pending 30. See description for bit 0.</description>
                                <bitOffset>0x1E</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TRP31</name>
                                <description>Transmission Request Pending 31. See description for bit 0.</description>
                                <bitOffset>0x1F</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_TXBAR</name>
                        <description>MCAN Tx Buffer Add Request</description>
                        <addressOffset>0xD0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>AR0</name>
                                <description>Add Request 0.
 
