therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G310X.svd
                    <register>
                        <name>CANFD0_MCAN_TXBCIE</name>
                        <description>MCAN Tx Buffer Cancellation Finished Interrupt Enable</description>
                        <addressOffset>0xE4</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>CFIE0</name>
                                <description>Cancellation Finished Interrupt Enable 0. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE1</name>
                                <description>Cancellation Finished Interrupt Enable 1. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE2</name>
                                <description>Cancellation Finished Interrupt Enable 2. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE3</name>
                                <description>Cancellation Finished Interrupt Enable 3. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE4</name>
                                <description>Cancellation Finished Interrupt Enable 4. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE5</name>
                                <description>Cancellation Finished Interrupt Enable 5. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE6</name>
                                <description>Cancellation Finished Interrupt Enable 6. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE7</name>
                                <description>Cancellation Finished Interrupt Enable 7. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE8</name>
                                <description>Cancellation Finished Interrupt Enable 8. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE9</name>
                                <description>Cancellation Finished Interrupt Enable 9. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x9</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE10</name>
                                <description>Cancellation Finished Interrupt Enable 10. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0xA</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE11</name>
                                <description>Cancellation Finished Interrupt Enable 11. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0xB</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE12</name>
                                <description>Cancellation Finished Interrupt Enable 12. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0xC</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE13</name>
                                <description>Cancellation Finished Interrupt Enable 13. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0xD</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE14</name>
                                <description>Cancellation Finished Interrupt Enable 14. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0xE</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE15</name>
                                <description>Cancellation Finished Interrupt Enable 15. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0xF</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE16</name>
                                <description>Cancellation Finished Interrupt Enable 16. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE17</name>
                                <description>Cancellation Finished Interrupt Enable 17. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x11</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE18</name>
                                <description>Cancellation Finished Interrupt Enable 18. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x12</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE19</name>
                                <description>Cancellation Finished Interrupt Enable 19. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x13</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE20</name>
                                <description>Cancellation Finished Interrupt Enable 20. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x14</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE21</name>
                                <description>Cancellation Finished Interrupt Enable 21. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x15</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE22</name>
                                <description>Cancellation Finished Interrupt Enable 22. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x16</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE23</name>
                                <description>Cancellation Finished Interrupt Enable 23. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x17</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE24</name>
                                <description>Cancellation Finished Interrupt Enable 24. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x18</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE25</name>
                                <description>Cancellation Finished Interrupt Enable 25. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x19</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE26</name>
                                <description>Cancellation Finished Interrupt Enable 26. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x1A</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE27</name>
                                <description>Cancellation Finished Interrupt Enable 27. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x1B</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE28</name>
                                <description>Cancellation Finished Interrupt Enable 28. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x1C</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE29</name>
                                <description>Cancellation Finished Interrupt Enable 29. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x1D</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE30</name>
                                <description>Cancellation Finished Interrupt Enable 30. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x1E</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CFIE31</name>
                                <description>Cancellation Finished Interrupt Enable 31. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled</description>
                                <bitOffset>0x1F</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_TXEFC</name>
                        <description>MCAN Tx Event FIFO Configuration</description>
                        <addressOffset>0xF0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>EFSA</name>
                                <description>Event FIFO Start Address. Start address of Tx Event FIFO in Message RAM (32-bit word address).</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0xE</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>EFS</name>
                                <description>Event FIFO Size. The Tx Event FIFO elements are indexed from 0 to EFS - 1.
  0      Tx Event FIFO disabled
  1-32  Number of Tx Event FIFO elements
  &gt;32   Values greater than 32 are interpreted as 32</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x6</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>EFWM</name>
                                <description>Event FIFO Watermark
  0      Watermark interrupt disabled
  1-32  Level for Tx Event FIFO watermark interrupt (IR.TEFW)
  &gt;32   Watermark interrupt disabled</description>
                                <bitOffset>0x18</bitOffset>
                                <bitWidth>0x6</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_TXEFS</name>
                        <description>MCAN Tx Event FIFO Status</description>
                        <addressOffset>0xF4</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>EFFL</name>
                                <description>Event FIFO Fill Level. Number of elements stored in Tx Event FIFO, range 0 to 32.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x6</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>EFGI</name>
                                <description>Event FIFO Get Index. Tx Event FIFO read index pointer, range 0 to 31.</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x5</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>EFPI</name>
                                <description>Event FIFO Put Index.Tx Event FIFO write index pointer, range 0 to 31.</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x5</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>EFF</name>
                                <description>Event FIFO Full
  0  Tx Event FIFO not full
  1  Tx Event FIFO full</description>
                                <bitOffset>0x18</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TEFL</name>
                                <description>Tx Event FIFO Element Lost. This bit is a copy of interrupt flag IR.TEFL. When IR.TEFL is reset, this bit is also reset.
  0  No Tx Event FIFO element lost
  1  Tx Event FIFO element lost, also set after write attempt to Tx Event FIFO of size zero.</description>
                                <bitOffset>0x19</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                        </fields>
                    </register>
