therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G310X.svd
                            <register>
                                <name>CANFD0_MCANERR_SEC_EOI</name>
                                <description>MCAN Single Error Corrected End of Interrupt Register</description>
                                <addressOffset>0x3C</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>EOI_WR</name>
                                        <description>Write to this register indicates that software has acknowledged the pending interrupt and the next interrupt can be sent to the host.
 
Note that a write to the  MCANERR_ERR_STAT1.CLR_ECC_SEC goes through the SVBUS and has a delayed completion. To avoid an additional interrupt, read the MCANERR_ERR_STAT1 register back prior to writing to this bit field.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANERR_SEC_STATUS</name>
                                <description>MCAN Single Error Corrected Interrupt Status Register</description>
                                <addressOffset>0x40</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>MSGMEM_PEND</name>
                                        <description>Message RAM SEC Interrupt Pending
  0  No SEC interrupt is pending
  1  SEC interrupt is pending</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANERR_SEC_ENABLE_SET</name>
                                <description>MCAN Single Error Corrected Interrupt Enable Set Register</description>
                                <addressOffset>0x80</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>MSGMEM_ENABLE_SET</name>
                                        <description>Message RAM SEC Interrupt Pending Enable Set. Writing a 1 to this bit enables the Message RAM SEC error interrupts. Writing a 0 has no effect. Reads return the corresponding enable bit's current value.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANERR_SEC_ENABLE_CLR</name>
                                <description>MCAN Single Error Corrected Interrupt Enable Clear Register</description>
                                <addressOffset>0xC0</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>MSGMEM_ENABLE_CLR</name>
                                        <description>Message RAM SEC Interrupt Pending Enable Clear. Writing a 1 to this bit disables the Message RAM SEC error interrupts. Writing a 0 has no effect. Reads return the corresponding enable bit's current value.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANERR_DED_EOI</name>
                                <description>MCAN Double Error Detected End of Interrupt Register</description>
                                <addressOffset>0x13C</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>EOI_WR</name>
                                        <description>Write to this register indicates that software has acknowledged the pending interrupt and the next interrupt can be sent to the host.
 
Note that a write to the  MCANERR_ERR_STAT1.CLR_ECC_DED goes through the SVBUS and has a delayed completion. To avoid an additional interrupt, read the MCANERR_ERR_STAT1 register back prior to writing to this bit field.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANERR_DED_STATUS</name>
                                <description>MCAN Double Error Detected Interrupt Status Register</description>
                                <addressOffset>0x140</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>MSGMEM_PEND</name>
                                        <description>Message RAM DED Interrupt Pending
  0  No DED interrupt is pending
  1  DED interrupt is pending</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANERR_DED_ENABLE_SET</name>
                                <description>MCAN Double Error Detected Interrupt Enable Set Register</description>
                                <addressOffset>0x180</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>MSGMEM_ENABLE_SET</name>
                                        <description>Message RAM DED Interrupt Pending Enable Set. Writing a 1 to this bit enables the Message RAM DED error interrupts. Writing a 0 has no effect. Reads return the corresponding enable bit's current value.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANERR_DED_ENABLE_CLR</name>
                                <description>MCAN Double Error Detected Interrupt Enable Clear Register</description>
                                <addressOffset>0x1C0</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>MSGMEM_ENABLE_CLR</name>
                                        <description>Message RAM DED Interrupt Pending Enable Clear. Writing a 1 to this bit disables the Message RAM DED error interrupts. Writing a 0 has no effect. Reads return the corresponding enable bit's current value.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANERR_AGGR_ENABLE_SET</name>
                                <description>MCAN Error Aggregator Enable Set Register</description>
                                <addressOffset>0x200</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>ENABLE_PARITY_SET</name>
                                        <description>Write 1 to enable parity errors. Reads return the corresponding enable bit's current value.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>ENABLE_TIMEOUT_SET</name>
                                        <description>Write 1 to enable timeout errors. Reads return the corresponding enable bit's current value.</description>
                                        <bitOffset>0x1</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANERR_AGGR_ENABLE_CLR</name>
                                <description>MCAN Error Aggregator Enable Clear Register</description>
                                <addressOffset>0x204</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>ENABLE_PARITY_CLR</name>
                                        <description>Write 1 to disable parity errors. Reads return the corresponding enable bit's current value.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>ENABLE_TIMEOUT_CLR</name>
                                        <description>Write 1 to disable timeout errors. Reads return the corresponding enable bit's current value.</description>
                                        <bitOffset>0x1</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANERR_AGGR_STATUS_SET</name>
                                <description>MCAN Error Aggregator Status Set Register</description>
                                <addressOffset>0x208</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>AGGR_PARITY_ERR</name>
                                        <description>Aggregator Parity Error Status
 
2-bit saturating counter of the number of parity errors that have occurred since last cleared.
  0  No parity errors have occurred
  1  One parity error has occurred
  2  Two parity errors have occurred
  3  Three parity errors have occurred
 
A write of a non-zero value to this bit field increments it by the value provided.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x2</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>SVBUS_TIMEOUT</name>
                                        <description>Aggregator Serial VBUS Timeout Error Status
 
2-bit saturating counter of the number of SVBUS timeout errors that have occurred since last cleared.
  0  No timeout errors have occurred
  1  One timeout error has occurred
  2  Two timeout errors have occurred
  3  Three timeout errors have occurred
 
A write of a non-zero value to this bit field increments it by the value provided.</description>
                                        <bitOffset>0x2</bitOffset>
                                        <bitWidth>0x2</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANERR_AGGR_STATUS_CLR</name>
                                <description>MCAN Error Aggregator Status Clear Register</description>
                                <addressOffset>0x20C</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>AGGR_PARITY_ERR</name>
                                        <description>Aggregator Parity Error Status
 
2-bit saturating counter of the number of parity errors that have occurred since last cleared.
  0  No parity errors have occurred
  1  One parity error has occurred
  2  Two parity errors have occurred
  3  Three parity errors have occurred
 
