therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G310X.svd
                            <register>
                                <name>CANFD0_ICLR</name>
                                <description>Interrupt clear</description>
                                <addressOffset>0x28</addressOffset>
                                <size>32</size>
                                <access>write-only</access>
                                <resetValue>0x00000000</resetValue>
                                <fields>
                                    <field>
                                        <name>INTL0</name>
                                        <description>Clear MCAN Interrupt Line 0.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>NO_EFFECT</name>
                                                    <description>Writing 0 has no effect</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Clear Interrupt</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>INTL1</name>
                                        <description>Clear MCAN Interrupt Line 1.</description>
                                        <bitOffset>0x1</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>NO_EFFECT</name>
                                                    <description>Writing 0 has no effect</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Clear Interrupt</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>SEC</name>
                                        <description>Clear Message RAM SEC interrupt.</description>
                                        <bitOffset>0x2</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>NO_EFFECT</name>
                                                    <description>Writing 0 has no effect</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Clear Interrupt</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>DED</name>
                                        <description>Clear Message RAM DED interrupt.</description>
                                        <bitOffset>0x3</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>NO_EFFECT</name>
                                                    <description>Writing 0 has no effect</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Clear Interrupt</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>EXT_TS_CNTR_OVFL</name>
                                        <description>Clear External Timestamp Counter Overflow interrupt.</description>
                                        <bitOffset>0x4</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>NO_EFFECT</name>
                                                    <description>Writing 0 has no effect</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Clear Interrupt</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>WAKEUP</name>
                                        <description>Clear Clock Stop Wake Up interrupt.</description>
                                        <bitOffset>0x5</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>NO_EFFECT</name>
                                                    <description>Writing 0 has no effect</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Clear Interrupt</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                </fields>
                            </register>
                        </cluster>
                        <register>
                            <name>CANFD0_EVT_MODE</name>
                            <description>Event Mode</description>
                            <addressOffset>0xE0</addressOffset>
                            <size>32</size>
                            <access>read-write</access>
                            <fields>
                                <field>
                                    <name>INT0_CFG</name>
                                    <description>Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT0]</description>
                                    <bitOffset>0x0</bitOffset>
                                    <bitWidth>0x2</bitWidth>
                                    <access>read-only</access>
                                    <enumeratedValues>
                                            <enumeratedValue>
                                                <name>DISABLE</name>
                                                <description>The interrupt or event line is disabled.</description>
                                                <value>0x0</value>
                                            </enumeratedValue>
                                            <enumeratedValue>
                                                <name>SOFTWARE</name>
                                                <description>The interrupt or event line is in software mode. Software must clear the RIS.</description>
                                                <value>0x1</value>
                                            </enumeratedValue>
                                            <enumeratedValue>
                                                <name>HARDWARE</name>
                                                <description>The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag.</description>
                                                <value>0x2</value>
                                            </enumeratedValue>
                                        </enumeratedValues>
                                    </field>
                            </fields>
                        </register>
                        <register>
                            <name>CANFD0_DESC</name>
                            <description>Module Description</description>
                            <addressOffset>0xFC</addressOffset>
                            <size>32</size>
                            <access>read-only</access>
                            <fields>
                                <field>
                                    <name>MINREV</name>
                                    <description>Minor rev of the IP</description>
                                    <bitOffset>0x0</bitOffset>
                                    <bitWidth>0x4</bitWidth>
                                    </field>
                                <field>
                                    <name>MAJREV</name>
                                    <description>Major rev of the IP</description>
                                    <bitOffset>0x4</bitOffset>
                                    <bitWidth>0x4</bitWidth>
                                    </field>
                                <field>
                                    <name>FEATUREVER</name>
                                    <description>Feature Set for the module *instance*</description>
                                    <bitOffset>0xC</bitOffset>
                                    <bitWidth>0x4</bitWidth>
                                    <enumeratedValues>
                                            <enumeratedValue>
                                                <name>VERSION_0</name>
                                                <description>MCAN module with CAN-FD mode enabled  &lt;&lt;Internal Note: This is an in-IP paper spin variant. How does this map to the SYS_MCAN_ENABLE_FD choice value?&gt;&gt;</description>
                                                <value>0x0</value>
                                            </enumeratedValue>
                                            <enumeratedValue>
                                                <name>VERSION_1</name>
                                                <description>MCAN module with CAN-FD mode disabled  &lt;&lt;Internal Note: This is an in-IP paper spin variant. How does this map to the SYS_MCAN_ENABLE_FD choice value?&gt;&gt;</description>
                                                <value>0x1</value>
                                            </enumeratedValue>
                                        </enumeratedValues>
                                    </field>
                                <field>
                                    <name>MODULEID</name>
                                    <description>Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness.</description>
                                    <bitOffset>0x10</bitOffset>
                                    <bitWidth>0x10</bitWidth>
                                    </field>
                            </fields>
                        </register>
                        <register>
                            <name>CANFD0_MCANSS_CLKEN</name>
                            <description>MCAN module clock enable</description>
                            <addressOffset>0x100</addressOffset>
                            <size>32</size>
                            <fields>
                                <field>
                                    <name>CLK_REQEN</name>
                                    <description>MCAN functional and MCAN/MCANSS MMR clock request enable bit</description>
                                    <bitOffset>0x0</bitOffset>
                                    <bitWidth>0x1</bitWidth>
                                    <enumeratedValues>
                                            <enumeratedValue>
                                                <name>CLR</name>
                                                <description>MCAN module functional clock and Vbusp is not requested.  These clocks are gated to the MCAN module.</description>
                                                <value>0x0</value>
                                            </enumeratedValue>
                                            <enumeratedValue>
                                                <name>SET</name>
                                                <description>Setting this bit requests MCAN module functional clock and Vbusp. These clocks are not gated to MCAN module.</description>
                                                <value>0x1</value>
                                            </enumeratedValue>
                                        </enumeratedValues>
                                    </field>
                            </fields>
                        </register>
                        <register>
                            <name>CANFD0_MCANSS_CLKDIV</name>
                            <description>Clock divider</description>
                            <addressOffset>0x104</addressOffset>
                            <size>32</size>
                            <access>read-write</access>
                            <fields>
                                <field>
                                    <name>RATIO</name>
                                    <description>Clock divide ratio specification. Enables configuring clock divide settings for the MCAN functional clock input to the MCAN-SS.</description>
                                    <bitOffset>0x0</bitOffset>
                                    <bitWidth>0x2</bitWidth>
                                    <access>read-write</access>
                                    <enumeratedValues>
                                            <enumeratedValue>
                                                <name>DIV_BY_1_</name>
                                                <description>Divides input clock by 1</description>
                                                <value>0x0</value>
                                            </enumeratedValue>
                                            <enumeratedValue>
                                                <name>DIV_BY_2_</name>
                                                <description>Divides input clock by 2</description>
                                                <value>0x1</value>
                                            </enumeratedValue>
                                            <enumeratedValue>
                                                <name>DIV_BY_4_</name>
                                                <description>Divides input clock by 4</description>
                                                <value>0x2</value>
                                            </enumeratedValue>
                                        </enumeratedValues>
                                    </field>
                            </fields>
                        </register>
                        <register>
                            <name>CANFD0_MCANSS_CLKCTL</name>
                            <description>MCAN-SS clock stop control register</description>
                            <addressOffset>0x108</addressOffset>
                            <size>32</size>
                            <access>read-write</access>
                            <resetValue>0x00000000</resetValue>
                            <fields>
                                <field>
                                    <name>STOPREQ</name>
                                    <description>This bit is used to enable/disable MCAN clock (both host clock and functional clock) gating request.

Note: This bit can be reset by HW by Clock-Stop Wake-up via CAN RX Activity. See spec for more details.</description>
                                    <bitOffset>0x0</bitOffset>
                                    <bitWidth>0x1</bitWidth>
                                    <enumeratedValues>
                                            <enumeratedValue>
                                                <name>DISABLE</name>
                                                <description>Disable MCAN-SS clock stop request</description>
                                                <value>0x0</value>
                                            </enumeratedValue>
                                            <enumeratedValue>
                                                <name>ENABLE</name>
                                                <description>Enable MCAN-SS clock stop request</description>
                                                <value>0x1</value>
                                            </enumeratedValue>
                                        </enumeratedValues>
                                    </field>
                                <field>
                                    <name>WAKEUP_INT_EN</name>
                                    <description>This bit contols enabling or disabling the MCAN IP clock stop wakeup interrupt (when MCANSS_CTRL.WAKEUPREQEN wakeup request is enabled to wakeup MCAN IP upon CAN RXD activity)</description>
                                    <bitOffset>0x4</bitOffset>
                                    <bitWidth>0x1</bitWidth>
                                    <access>read-write</access>
                                    <enumeratedValues>
                                            <enumeratedValue>
                                                <name>DISABLE</name>
                                                <description>Disable MCAN IP clock stop wakeup interrupt</description>
                                                <value>0x0</value>
                                            </enumeratedValue>
                                            <enumeratedValue>
                                                <name>ENABLE</name>
                                                <description>Enable MCAN IP clock stop wakeup interrupt</description>
                                                <value>0x1</value>
                                            </enumeratedValue>
                                        </enumeratedValues>
                                    </field>
                                <field>
                                    <name>WKUP_GLTFLT_EN</name>
                                    <description>Setting this bit enables the glitch filter on MCAN RXD input, which wakes up the MCAN controller to exit clock gating.</description>
                                    <bitOffset>0x8</bitOffset>
                                    <bitWidth>0x1</bitWidth>
                                    <access>read-write</access>
                                    <enumeratedValues>
                                            <enumeratedValue>
                                                <name>DISABLE</name>
                                                <description>Disable glitch filter enable on RXD input when MCAN is in clock stop mode (waiting for event on RXD input for clock stop wakeup).</description>
                                                <value>0x0</value>
                                            </enumeratedValue>
                                            <enumeratedValue>
                                                <name>ENABLE</name>
                                                <description>Enable glitch filter enable on RXD input when MCAN is in clock stop mode (waiting for event on RXD input for clock stop wakeup).</description>
                                                <value>0x1</value>
                                            </enumeratedValue>
                                        </enumeratedValues>
                                    </field>
                            </fields>
                        </register>
