therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G310X.svd
Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved.</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CCCTL0_LCOND</name>
                                            <description>CCCTL_0 LCOND</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCCTL1_LCOND</name>
                                            <description>CCCTL_1 LCOND</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCCTL2_LCOND</name>
                                            <description>CCCTL_2 LCOND This value exists when there are 4 channels.</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCCTL3_LCOND</name>
                                            <description>CCCTL_3 LCOND This value exists when there are 4 channels.</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>QEI_2INP</name>
                                            <description>Controlled by 2 input QEI mode. This value exists when gptimer support QEI feature.</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>QEI_3INP</name>
                                            <description>Controlled by 3 input QEI mode.  This value exists when gptimer support QEI feature.</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CAC</name>
                                <description>Counter Advance Control.  This field specifies what controls the counter operation with respect to advancing (incrementing or decrementing) the counter value.  
Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved.</description>
                                <bitOffset>0xA</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CCCTL0_ACOND</name>
                                            <description>CCCTL_0 ACOND</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCCTL1_ACOND</name>
                                            <description>CCCTL_1 ACOND</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCCTL2_ACOND</name>
                                            <description>CCCTL_2 ACOND This value exists when there are 4 channels.</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCCTL3_ACOND</name>
                                            <description>CCCTL_3 ACOND This value exists when there are 4 channels.</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>QEI_2INP</name>
                                            <description>Controlled by 2-input QEI mode  This value exists when gptimer support QEI feature.</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>QEI_3INP</name>
                                            <description>Controlled by 3-input QEI mode  This value exists when gptimer support QEI feature.</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CZC</name>
                                <description>Counter Zero Control This field specifies what controls the counter operation with respect to zeroing the counter value.  

Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved.</description>
                                <bitOffset>0xD</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CCCTL0_ZCOND</name>
                                            <description>CCCTL_0 ZCOND</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCCTL1_ZCOND</name>
                                            <description>CCCTL_1 ZCOND</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCCTL2_ZCOND</name>
                                            <description>CCCTL_2 ZCOND This value exists when there are 4 channels.</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCCTL3_ZCOND</name>
                                            <description>CCCTL_3 ZCOND This value exists when there are 4 channels.</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>QEI_2INP</name>
                                            <description>Controlled by 2-input QEI mode  This value exists when gptimer support QEI feature.</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>QEI_3INP</name>
                                            <description>Controlled by 3-input QEI mode  This value exists when gptimer support QEI feature.</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>TIMG8_LOAD</name>
                        <description>Load Register</description>
                        <addressOffset>0x8</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>LD</name>
                                <description>Load Value</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x10</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <dim>2</dim>
                        <dimIncrement>4</dimIncrement>
                        <dimArrayIndex>0,1</dimArrayIndex>
                        <name>TIMG8_CC_01[%s]</name>
                        <description>Capture or Compare Register 0 to Capture or Compare Register 1</description>
                        <addressOffset>0x10</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>CCVAL</name>
                                <description>Capture or compare value</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x10</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
